import { ColorTheme } from "src/tailwindCSS/ColorTheme";
import { tailwindToRGB } from "src/functions/CalculateColor";
import { figma } from "./SVG";
const commons = {
  title: "rnasterpiece",
  link: "https://github.com/BNO0/rnasterpiece",
  linkTitle: "Github - rnasterpiece",
  linkIcon: <svg xmlns="http://www.w3.org/2000/svg" x="0px" y="0px" width="28" height="28" viewBox="0 0 64 64">
    <path d="M 32 10 C 19.85 10 10 19.85 10 32 C 10 44.15 19.85 54 32 54 C 44.15 54 54 44.15 54 32 C 54 19.85 44.15 10 32 10 z M 32 14 C 41.941 14 50 22.059 50 32 C 50 40.238706 44.458716 47.16934 36.904297 49.306641 C 36.811496 49.1154 36.747844 48.905917 36.753906 48.667969 C 36.784906 47.458969 36.753906 44.637563 36.753906 43.601562 C 36.753906 41.823563 35.628906 40.5625 35.628906 40.5625 C 35.628906 40.5625 44.453125 40.662094 44.453125 31.246094 C 44.453125 27.613094 42.554688 25.720703 42.554688 25.720703 C 42.554688 25.720703 43.551984 21.842266 42.208984 20.197266 C 40.703984 20.034266 38.008422 21.634812 36.857422 22.382812 C 36.857422 22.382813 35.034 21.634766 32 21.634766 C 28.966 21.634766 27.142578 22.382812 27.142578 22.382812 C 25.991578 21.634813 23.296016 20.035266 21.791016 20.197266 C 20.449016 21.842266 21.445312 25.720703 21.445312 25.720703 C 21.445312 25.720703 19.546875 27.611141 19.546875 31.244141 C 19.546875 40.660141 28.371094 40.5625 28.371094 40.5625 C 28.371094 40.5625 27.366329 41.706312 27.265625 43.345703 C 26.675939 43.553637 25.872132 43.798828 25.105469 43.798828 C 23.255469 43.798828 21.849984 42.001922 21.333984 41.169922 C 20.825984 40.348922 19.7845 39.660156 18.8125 39.660156 C 18.1725 39.660156 17.859375 39.981656 17.859375 40.347656 C 17.859375 40.713656 18.757609 40.968484 19.349609 41.646484 C 20.597609 43.076484 20.574484 46.292969 25.021484 46.292969 C 25.547281 46.292969 26.492043 46.171872 27.246094 46.068359 C 27.241926 47.077908 27.230199 48.046135 27.246094 48.666016 C 27.251958 48.904708 27.187126 49.114952 27.09375 49.306641 C 19.540258 47.168741 14 40.238046 14 32 C 14 22.059 22.059 14 32 14 z"></path>
  </svg>,
}
const Project_2209_rnasterpiece = [
  {
    title: commons.title,
    link: commons.link,
    linkTitle: commons.linkTitle,
    linkIcon: commons.linkIcon,
    datas: [
      {
        title: "개요",
        contents: `한글 NFT 발행 및 거래.
        플랫폼 서비스`,
      },
      {
        title: "기술스택",
        contents: `Typescript, Web3JS.
        React, Redux`
      },
      {
        title: "주요기능",
        contents: `한글 자모음 합성, NFT 발행.
        이더리움 기반 거래`
      },
    ],
    image: {
      type: "string",
      imgs: [
        "Project_rnasterpiece_로그인.gif",
        "Project_rnasterpiece_NFT거래.gif",
      ],
    },
  },
  {
    title: "rnasterpiece - 주요 담당 역할",
    datas: [
      {
        title: "한글 처리 기능",
        contents: `한글 합성 및 분해 기능 구현.
        drag&drop 이벤트 처리`,
        icon: <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" fill="currentColor" className="size-8">
          <path fill={`${tailwindToRGB(ColorTheme.icon_bgColor)}`} d="M9 2.25a.75.75 0 0 1 .75.75v1.506a49.384 49.384 0 0 1 5.343.371.75.75 0 1 1-.186 1.489c-.66-.083-1.323-.151-1.99-.206a18.67 18.67 0 0 1-2.97 6.323c.318.384.65.753 1 1.107a.75.75 0 0 1-1.07 1.052A18.902 18.902 0 0 1 9 13.687a18.823 18.823 0 0 1-5.656 4.482.75.75 0 0 1-.688-1.333 17.323 17.323 0 0 0 5.396-4.353A18.72 18.72 0 0 1 5.89 8.598a.75.75 0 0 1 1.388-.568A17.21 17.21 0 0 0 9 11.224a17.168 17.168 0 0 0 2.391-5.165 48.04 48.04 0 0 0-8.298.307.75.75 0 0 1-.186-1.489 49.159 49.159 0 0 1 5.343-.371V3A.75.75 0 0 1 9 2.25ZM15.75 9a.75.75 0 0 1 .68.433l5.25 11.25a.75.75 0 1 1-1.36.634l-1.198-2.567h-6.744l-1.198 2.567a.75.75 0 0 1-1.36-.634l5.25-11.25A.75.75 0 0 1 15.75 9Zm-2.672 8.25h5.344l-2.672-5.726-2.672 5.726Z" clipRule="evenodd" />
        </svg>,
      },
      {
        title: "컴포넌트 모듈화",
        contents: `재사용성을 위한 Component 모듈화 작업`,
        icon: <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" fill="currentColor" className="size-8">
          <path fill={`${tailwindToRGB(ColorTheme.icon_bgColor)}`} d="M11.25 5.337c0-.355-.186-.676-.401-.959a1.647 1.647 0 0 1-.349-1.003c0-1.036 1.007-1.875 2.25-1.875S15 2.34 15 3.375c0 .369-.128.713-.349 1.003-.215.283-.401.604-.401.959 0 .332.278.598.61.578 1.91-.114 3.79-.342 5.632-.676a.75.75 0 0 1 .878.645 49.17 49.17 0 0 1 .376 5.452.657.657 0 0 1-.66.664c-.354 0-.675-.186-.958-.401a1.647 1.647 0 0 0-1.003-.349c-1.035 0-1.875 1.007-1.875 2.25s.84 2.25 1.875 2.25c.369 0 .713-.128 1.003-.349.283-.215.604-.401.959-.401.31 0 .557.262.534.571a48.774 48.774 0 0 1-.595 4.845.75.75 0 0 1-.61.61c-1.82.317-3.673.533-5.555.642a.58.58 0 0 1-.611-.581c0-.355.186-.676.401-.959.221-.29.349-.634.349-1.003 0-1.035-1.007-1.875-2.25-1.875s-2.25.84-2.25 1.875c0 .369.128.713.349 1.003.215.283.401.604.401.959a.641.641 0 0 1-.658.643 49.118 49.118 0 0 1-4.708-.36.75.75 0 0 1-.645-.878c.293-1.614.504-3.257.629-4.924A.53.53 0 0 0 5.337 15c-.355 0-.676.186-.959.401-.29.221-.634.349-1.003.349-1.036 0-1.875-1.007-1.875-2.25s.84-2.25 1.875-2.25c.369 0 .713.128 1.003.349.283.215.604.401.959.401a.656.656 0 0 0 .659-.663 47.703 47.703 0 0 0-.31-4.82.75.75 0 0 1 .83-.832c1.343.155 2.703.254 4.077.294a.64.64 0 0 0 .657-.642Z" />
        </svg>,
      },
      {
        title: "상태 관리",
        contents: `Redux를 통한 효율적인 State 관리`,
        icon: <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" fill="currentColor" className="size-8">
          <path fill={`${tailwindToRGB(ColorTheme.icon_bgColor)}`} d="M12 6.75a5.25 5.25 0 0 1 6.775-5.025.75.75 0 0 1 .313 1.248l-3.32 3.319c.063.475.276.934.641 1.299.365.365.824.578 1.3.64l3.318-3.319a.75.75 0 0 1 1.248.313 5.25 5.25 0 0 1-5.472 6.756c-1.018-.086-1.87.1-2.309.634L7.344 21.3A3.298 3.298 0 1 1 2.7 16.657l8.684-7.151c.533-.44.72-1.291.634-2.309A5.342 5.342 0 0 1 12 6.75ZM4.117 19.125a.75.75 0 0 1 .75-.75h.008a.75.75 0 0 1 .75.75v.008a.75.75 0 0 1-.75.75h-.008a.75.75 0 0 1-.75-.75v-.008Z" clipRule="evenodd" />
          <path fill={`${tailwindToRGB(ColorTheme.icon_bgColor)}`} d="m10.076 8.64-2.201-2.2V4.874a.75.75 0 0 0-.364-.643l-3.75-2.25a.75.75 0 0 0-.916.113l-.75.75a.75.75 0 0 0-.113.916l2.25 3.75a.75.75 0 0 0 .643.364h1.564l2.062 2.062 1.575-1.297Z" />
          <path fill={`${tailwindToRGB(ColorTheme.icon_bgColor)}`} d="m12.556 17.329 4.183 4.182a3.375 3.375 0 0 0 4.773-4.773l-3.306-3.305a6.803 6.803 0 0 1-1.53.043c-.394-.034-.682-.006-.867.042a.589.589 0 0 0-.167.063l-3.086 3.748Zm3.414-1.36a.75.75 0 0 1 1.06 0l1.875 1.876a.75.75 0 1 1-1.06 1.06L15.97 17.03a.75.75 0 0 1 0-1.06Z" clipRule="evenodd" />
        </svg>,
      },
    ],
    image: {
      type: "string",
      imgs: [
        "Project_rnasterpiece_한글단어합성.gif",
        "Project_rnasterpiece_한글NFT민팅.gif",
      ],
    },
    details: [
      {
        title: "담당역할",
        contents: `재사용성을 위한 Component 모듈화
        메인페이지 구현 (Carousel, scrollIntoView 사용).
        한글 합성기능 구현.
        한글 분해기능 구현.
        drag&drop 관련 event 처리.
        Redux를 통한 State 관리`,
      },
      {
        title: "구현과정",
        contents: `초/중/종성에 맞는 자모음 분리해 각 음절 합성, 분해.
        한글 Unicode를 이용하여 합성, 분해 기능 구현.
        합성/분해 구역을 분리하고 drag&drop 관련 event 처리.
        dragStart, dragEnd 시 드래그 중인 element 정보 저장.
        (startArea / elementIndex / value).
        분해구역으로 이동.
        공백/개행이 아닌 경우만 startArea 에서 삭제.
        합성구역으로 이동.
        합성구역의 순서 재배치, startArea에서 삭제.
        음절대기구역으로 이동.
        공백/개행이 아닌 경우만 음절대기구역에 추가.
        startArea에서 삭제.
        한글 합성/분해 시 음절 복제버그 해결 Main.
        Element.scrollIntoView() 를 사용해 자동스크롤.
        react-material-ui-carousel 사용해 미리보기 영상 제공.
        재사용을 위한 component 모듈화.
        메인페이지 more info, 이름한글변환.
        음절합성체험, 음절합성`,
      },
      {
        title: "문제해결",
        contents: `문장 합성 시 "\\n"을 개행이 아닌 공백으로 인식하는 문제 발생.
        HTML에서 개행, 공백 모두 하나의 띄어쓰기로 출력하기 때문.
        합성된 문자를 split("\\n") 을 통해 list 로 분리 후 분리된 문자열마다 태그 추가.
        한글 합성/분해 시 음절 복제 버그 발생.
        map 사용 시 해당 component의 string값으로 key 설정.
        > 같은 string 값을 가지는 component는 key가 중복됨.
        DragAndDrop을 처리하는 과정에서 올바른 component를 찾지 못해 component가 복사되는 버그 발생.
        각 구역 list 값들의 index를 key 값에 추가.
        > 임시적으로 key 중복 제거했으나 렌더링 효율 좋지 못함.
        전역변수를 만들어 component 생성마다 번호값 부여 후 해당번호를 key로 부여`,
      },
    ],
  },
];
const DetailPage_2209_rnasterpiece = {
  title: commons.title,
  link: commons.link,
  linkTitle: commons.linkTitle,
  linkIcon: commons.linkIcon,
  datas: [
    {
      title: `Figma`,
      svg: figma,
      link: `https://www.figma.com/proto/9bDpXrTghaTNQZmQzqTH7d/%ED%8A%B9%ED%99%94%ED%94%84%EB%A1%9C%EC%A0%9D%ED%8A%B8?node-id=2252-8997&p=f&t=qQxCRljhb9sGQBLf-1&scaling=min-zoom&content-scaling=fixed&page-id=0%3A1&starting-point-node-id=2252%3A8997`,
      // link: `https://www.figma.com/design/9bDpXrTghaTNQZmQzqTH7d/%ED%8A%B9%ED%99%94%ED%94%84%EB%A1%9C%EC%A0%9D%ED%8A%B8?node-id=0-1&t=n20t96q0ChS0Op0S-1`,
      image: {
        type: "string",
        imgs: [
          "figma_rnasterpiece.png",
        ],
      },
    },
    {
      title: `API`,
      image: {
        type: "string",
        imgs: [
          "api_rnasterpiece.png",
        ],
      },
    },
    {
      title: `ERD`,
      image: {
        type: "string",
        imgs: [
          "erd_rnasterpiece.png",
        ],
      },
    },
  ]
};
export default Project_2209_rnasterpiece;
export {DetailPage_2209_rnasterpiece};